[
	{
		"id": "1",
		"type": "misc",
		"day": "7",
		"start": "09:00",
		"end": "09:30",
		"title": "Registration + Coffee",
		"text": "",
		"duration": "30"
	},
	{
		"id": "2",
		"type": "misc",
		"day": "7",
		"start": "09:30",
		"end": "09:40",
		"title": "Opening",
		"text": "",
		"duration": "10"
	},
	{
		"id": "3",
		"type": "talk",
		"day": "7",
		"start": "09:40",
		"end": "10:10",
		"title": "Keynote: The State Of JavaScript",
		"duration": "30",
		"speaker": "Sacha Greif",
		"slug": "the-state-of-javascript",
		"img": "greif",
		"text": "Sacha is a designer, developer, and entrepreneur. After suffering through many years (ok, just three) of computer science classes, he decided his true calling was design and parlayed a love of textfields and checkboxes into a mildly successful career as a freelance UI designer. Lately though, he's been thinking this coding thing might have some legs after all, and spends his time on various open-source projects such as Vulcan. He's also the creator of Sidebar, a daily newsletter of design links.",
		"description":"Creator of Sidebar, The State of JavaScript, & more"
	},
	{
		"id": "4",
		"type": "talk",
		"day": "7",
		"start": "10:10",
		"end": "10:40",
		"title": "5 architectures of asynchronous JavaScript",
		"duration": "30",
		"speaker": "Tomasz Ducin",
		"slug": "5-architectures-of-asynchronous-javascript",
		"img": "ducin",
		"text": "In this talk we'll discuss 5 alternative approaches to handle async operations: callbacks, events, promises, coroutines and reactive streams. None of them is either legacy or a silver bullet - a good dev needs to pick the right tool for the job. However, in order to understand them, we must step back to fundamentals all these rely on: the mechanics of event loop and run to completion rule, as well as learn to distinguish between sync and async flow. Then we proceed to design patterns built on top of each of the 5 approaches, discussing their strengths and limitations. Funfacts, such as famous Promise.race() included!",
		"description": "Freelance developer and trainer"
	},
	{
		"id": "5",
		"type": "misc",
		"day": "7",
		"start": "11:10",
		"end": "11:25",
		"title": "Break",
		"text": "",
		"duration": "15"
	},
	{
		"id": "6",
		"type": "talk",
		"day": "7",
		"start": "11:25",
		"end": "11:55",
		"title": "Best Practices for GraphQL and GraphQL Subscriptions at Scale",
		"duration": "30",
		"speaker": "Laney Kuenzel Zamore & Adam Kramer",
		"slug": "best-practices-for-graphql-subscriptions-at-scale",
		"img": "kramer",
		"text": "GraphQL is a query language for APIs and a runtime for fulfilling those queries. Using GraphQL, a client can declaratively describe the data that it needs, and the GraphQL server will return exactly that data in a predictable shape. GraphQL Subscriptions, recently added to the open-source GraphQL spec, provides a way for clients to subscribe to real-time updates. Facebook has been using GraphQL in production for over five years and GraphQL Subscriptions in production for over two years. In this talk, we will start with an introduction to GraphQL and GraphQL Subscriptions. We will then discuss various lessons that our team has learned from operating these systems in production at Facebook. We’ll share some best practices for building out a GraphQL schema in a scalable way, implementing GraphQL Subscriptions, and designing GraphQL servers and clients for your application.",
		"description": "Developers at Facebook"
	},
	{
		"id": "7",
		"type": "talk",
		"day": "7",
		"start": "11:55",
		"end": "12:10",
		"title": "Sociolinguistics and the Javascript community: a love story",
		"duration": "15",
		"speaker": "Harriet Lawrence",
		"slug": "sociolinguistics-and-the-javascript-community-a-love-story",
		"img": "lawrence",
		"text": "Did you know that how we learn JavaScript has changed a huge amount over the last ten years? Lots of small changes in how we introduce people to JS have built up over time into a radical difference - these changes are based in sociolinguistics! Our community’s communication has evolved rapidly. We’ve moved from only valuing the opinions of senior developers to recognising the importance of contributions from people at all stages of learning. Learning itself has become a form of participating. These are examples of the sociolinguistic concepts of legitimation and positive welcoming. My talk will introduce the basics of sociolinguistics, how we are already using them, and how we can integrate them more effectively to start building a more inclusive and welcoming space for everyone in the JS community.",
		"description": "Technical Writer at Buildkite"
	},
	{
		"id": "8",
		"type": "lightning",
		"day": "7",
		"start": "12:10",
		"end": "12:15",
		"title": "Lightning talk: Service Workers, use them",
		"duration": "5",
		"speaker": "Pontus Lundin",
		"link": "https://twitter.com/pontahontas",
		"handle": "@pontahontas",
		"slug": "service-workers-use-them"
	},
	{
		"id": "9",
		"type": "lightning",
		"day": "7",
		"start": "12:15",
		"end": "12:20",
		"title": "Lightning talk: From citizen initiative to governmental agency process and back again",
		"duration": "5",
		"speaker": "Johan Öbrink",
		"link": "https://twitter.com/johanobrink",
		"handle": "@johanobrink",
		"slug": "from-citizen-initiative-to-governmental-agency-process-and-back-again"
	},
	{
		"id": "10",
		"type": "misc",
		"day": "7",
		"start": "12:20",
		"end": "13:30",
		"title": "Lunch",
		"text": "",
		"duration": "70"
	},
	{
		"id": "11",
		"type": "talk",
		"day": "7",
		"start": "13:30",
		"end": "14:00",
		"title": "You're only supposed to blow the bloody doors off!",
		"duration": "30",
		"speaker": "Léonie Watson",
		"slug": "you-are-only-supposed-to-blow-the-bloddy-doors-off",
		"img": "watson",
		"text": "What do these imortal words, from Charlie Crocker (AKA Michael Caine) in The Italian Job, have to do with JavaScript? More than you might think. It is often said that JavaScript makes things inaccessible with a screen reader. This is not true though. It is possible to do good and bad things with JavaScript (as with any other language, or even dynamite) - but it helps if you understand accessibility mechanics in the browser if you want to avoid unexpected consequences. If you have ever used JavaScript to provide keyboard shortcuts, or used the ARIA application role to enable accessible software UI interactions on the web, there is a good chance it had unintended consequences for screen reader users. Using code examples and screen reader demos, Léonie will look at accessibility mechanics in the browser, the new Accessibility Object Model (AOM) JavaScript API, and how to use JavaScript so you only blow the bloody doors off!",
		"description": "Accessibility Engineer, W3C Advisory Board"
	},
	{
		"id": "12",
		"type": "talk",
		"day": "7",
		"start": "14:00",
		"end": "14:30",
		"title": "A Brief History of Prototypes",
		"duration": "30",
		"speaker": "Katerina Marchán",
		"slug": "a-brief-history-of-prototypes",
		"img": "marchan",
		"text": "JavaScript is probably the most famous example of a prototype-based language. But what is prototype-based programming? Where did it all come from? What's the big deal? Why is JavaScript's version of it the way it is? Prototype-oriented programming has been around for over 30 years now. From its earliest days as a series of language extensions for various languages, to the release of Self and the compiler technology it developed that's used by Chrome and Node.js, to the rise of JavaScript and beyond -- it has been an incredibly influential take on the concept of object-orientation, and withstood the test of time against its class-based counterparts. A Brief History of Prototypes will tell the story of this programming paradigm, the decisions and mistakes, the technological breakthroughs it led, its explosive rise in popularity on the back of ECMAScript, and puts it all in context with the way we use prototype-based languages today.",
		"description": "Developer, npm CLI team"
	},
	{
		"id": "13",
		"type": "misc",
		"day": "7",
		"start": "14:30",
		"end": "15:00",
		"title": "Swedish FIKA!",
		"text": "",
		"duration": "30"
	},
	{
		"id": "14",
		"type": "talk",
		"day": "7",
		"start": "15:00",
		"end": "15:30",
		"title": "Best Practices for reusable UI components",
		"duration": "30",
		"speaker": "Mars Jullian",
		"slug": "best-practices-for-reusable-ui-components",
		"img": "jullian",
		"text": "React is awesome but even good frameworks don’t prevent you from writing bad code. This talk will focus on some key principles for writing reusable UI components that will make them fun to use and keep your co-workers from going crazy. ReactJS has been adopted by many companies around the world and encouraged Frontend engineers to think about UI's in terms of small components, as opposed to large applications. While we as a community have started writing our UI's in terms of components, we are all still learning about the best way to write those components. What size should the components be? How much state should each component contain? This talk puts forth some best practices learned while building a reusable UI component library for an entire engineering team. And while the talk is specific to writing reusable UI components in React, the best practices and ways of thinking about components presented in this talk can be can be applied to components written in other frameworks as well.",
		"description": "UI Engineer at Netflix"
	},
	{
		"id": "15",
		"type": "talk",
		"day": "7",
		"start": "15:30",
		"end": "16:00",
		"title": "The Design and Evolution of Event-Driven Databases",
		"duration": "30",
		"speaker": "Mark Nadal",
		"slug": "the-design-and-evolution-of-event-driven-databases",
		"img": "nadal",
		"text": "Databases are hard, right? No, they are a joke compared to Elon Musk who can balance rockets the size of skyscrapers on a pinhead. These are new times, with 100B+ IoT sensors, drones, self-driving cars and 5B+ new humans watching cat videos online. All it takes to solve any problems is clear thinking, good engineering, and people like you. Let's do this, let's build a database!",
		"description": "Founder of gunDB"
	},
	{
		"id": "16",
		"type": "lightning",
		"day": "7",
		"start": "16:00",
		"end": "16:05",
		"title": "Lightning talk: Writing cross-platform editor plugins",
		"duration": "5",
		"speaker": "Henric Trotzig",
		"slug": "writing-cross-platform-editor-plugins",
		"img": "trotzig"
	},
	{
		"id": "17",
		"type": "lightning",
		"day": "7",
		"start": "16:05",
		"end": "16:10",
		"title": "Lightning talk: Payment Request API in a React high order component",
		"duration": "5",
		"speaker": "Marco Lanaro",
		"slug": "payment-request-api-in-a-react-high-order-component",
		"img": "lanaro"
	},
	{
		"id": "18",
		"type": "misc",
		"day": "7",
		"start": "16:10",
		"end": "16:40",
		"title": "Break",
		"text": "",
		"duration": "30"
	},
	{
		"id": "19",
		"type": "talk",
		"day": "7",
		"start": "16:40",
		"end": "17:10",
		"title": "Solving layout problems with CSS Grid and friends",
		"duration": "30",
		"speaker": "Rachel Andrew",
		"slug": "solving-layout-problems-with-css-grid-and-friends",
		"img": "andrew",
		"text": "CSS Grid Layout launched into the majority of our browsers in 2017. As designers and developers have started to use Grid I’ve been answering a lot of questions about the specification. In this talk I’ll answer some of the common questions about Grid Layout in production - from dealing with old browsers to what might come next in CSS for layout. There will be plenty of practical tips for you to use in your projects today.",
		"description": "Developer and founder of Perch"
	},
	{
		"id": "20",
		"type": "talk",
		"day": "7",
		"start": "17:10",
		"end": "17:40",
		"title": "Keynote: The hilarious misadventures of being a platform downstream from your language",
		"duration": "30",
		"speaker": "Myles Borins",
		"slug": "the-hilarious-misadventures-of-being-a-platform-downstream-from-your-language",
		"img": "borins",
		"text": "There is a group called tc39, they work on a standard called ecma262. The standard is for a language called JavaScript. This language is implemented by various vendors, generally companies who make browsers. Google has V8, Mozilla has SpiderMonkey, Microsoft has Chakra, and Apple has JSCore. So there is this platform called Node.js. It has a small core philosophy and prides itself on offering a stable ecosystem. Here is where things get weird; What happens when new language features are specified and they land in the VM you embed? What happens when the VM you embed updates their compiler? What happens when you have a community that doesn't neccessarily want things to change?",
		"description": "TC39 delegate and Google Developer Advocate for Node.js"
	},
	{
		"id": "21",
		"type": "misc",
		"day": "7",
		"start": "17:40",
		"end": "17:50",
		"title": "Closing",
		"text": "",
		"duration": "10"
	},
	{
		"id": "22",
		"type": "misc",
		"day": "7",
		"start": "17:50",
		"end": "22:00",
		"title": "Techno Ping Pong",
		"text": "There will be beer, food, techno, ping and pong all evening!",
		"duration": "250",
		"slug": "techno-ping-pong"
	},
	{
		"id": "23",
		"type": "overlap",
		"day": "7",
		"start": "18:30",
		"end": "19:30",
		"title": "VulcanJS workshop (60 seats)",
		"duration": "60",
		"speaker": "Sacha Greif",
		"signup": true,
		"slug": "vulcanjs-workshop-60-seats",
		"img": "greif"
	},
	{
		"id": "25",
		"type": "talk",
		"day": "8",
		"start": "08:00",
		"end": "09:00",
		"title": "Equality Pep-talk Breakfast (60 seats)",
		"duration": "60",
		"speaker": "",
		"signup": true,
		"slug": "equality-pep-talk-breakfast"
	},
	{
		"id": "26",
		"type": "misc",
		"day": "8",
		"start": "09:00",
		"end": "09:20",
		"title": "Coffee + Registration",
		"text": "",
		"duration": "20"
	},
	{
		"id": "27",
		"type": "misc",
		"day": "8",
		"start": "09:20",
		"end": "09:30",
		"title": "Opening",
		"text": "",
		"duration": "10"
	},
	{
		"id": "28",
		"type": "talk",
		"day": "8",
		"start": "09:30",
		"end": "10:20",
		"title": "Keynote: The future of the web and the curious case of the unintended silo",
		"duration": "50",
		"speaker": "Paul Kinlan",
		"slug": "the-future-of-the-web-and-the-curious-case-of-the-unintended-silo",
		"img": "kinlan",
		"text": "In this talk, Paul will cover the past, present and future of the web. We will dive into some of the exciting changes that have been happening on the web with Progressive Web Applications enabling you to be build fast, capable and resilient sites and apps and we will focus on how we can ensure the future health of the web by ensuring that our experiences can be connected with the sites, apps, devices and the web around us.",
		"description": "Web Developer Advocate at Google"
	},
	{
		"id": "29",
		"type": "talk",
		"day": "8",
		"start": "10:20",
		"end": "10:35",
		"title": "Who Cares Why Undefined Is Not a Function",
		"duration": "15",
		"speaker": "Tereza Sokol",
		"slug": "who-cares-why-undefined-is-not-a-function",
		"img": "sokol",
		"text": "We can easily list a lot of technical difference between JavaScript and Elm, but how does switching to Elm change your day to day experience? In this talk, we will walk through some common frustrations in the front-end life, how Elm can elevate some of these issues, and explore what you could spend your time on if you were never worried about undefined not being a function.",
		"description": "Developer at NoRedInk"
	},
	{
		"id": "30",
		"type": "misc",
		"day": "8",
		"start": "10:35",
		"end": "11:05",
		"title": "Break",
		"text": "",
		"duration": "30"
	},
	{
		"id": "31",
		"type": "talk",
		"day": "8",
		"start": "11:05",
		"end": "11:35",
		"title": "Fun With Serverless Javascript",
		"duration": "30",
		"speaker": "Lorna Mitchell",
		"slug": "fun-with-serverless-javascript",
		"img": "mitchell",
		"text": "Serverless and the noOps movement are buzzwords that you've probably heard, but could these technologies also solve problems that you actually have? This session will cover when to use a serverless approach, and answer your questions about how to get started with it. We'll look at how to write code for these platforms, and how to safely and repeatedly deploy your code to them. We'll also look at how we can use these technologies to build a skill for the Amazon Echo.",
		"description": "Developer Advocate at IBM Watson Data Platform"
	},
	{
		"id": "32",
		"type": "talk",
		"day": "8",
		"start": "11:35",
		"end": "11:50",
		"title": "Down the Rabbit Hole: JS in Wonderland",
		"duration": "15",
		"speaker": "Claudia Hernández",
		"slug": "down-the-rabbit-hole-js-in-wonderland",
		"img": "hernandez",
		"text": "What even makes sense in Javascript ? For a language originally created in 10 days it surely has a lot of quirks and perks many JS developers are unaware of. Sometimes, it might even seem like we fell down the rabbit hole only to find that NaN is actually a Number, undefined can be defined, +!![] equals 1, Array.sort()may not work as you suspected and so much other nonsense that can trip any JS developer’s mind. This talk is a collection of Javascript’s oddities and unexpected behaviors that hopefully will prevent some future headaches and help understand the language that we all love in a more deeper and meaningful way.",
		"description": "Developer at Dailymotion"
	},
	{
		"id": "33",
		"type": "lightning",
		"day": "8",
		"start": "11:50",
		"end": "11:55",
		"title": "Lightning talk: Renderless React Components",
		"duration": "5",
		"speaker": "Findlay Hannam",
		"slug": "renderless-react-components"
	},
	{
		"id": "34",
		"type": "lightning",
		"day": "8",
		"start": "11:55",
		"end": "12:00",
		"title": "Lightning talk: Machine Learning Intuitions for DeepLearn.js",
		"duration": "5",
		"speaker": "Amir Hossein Rahnama",
		"slug": "machine-learning-intuitions-for-deeplearnjs"
	},
	{
		"id": "35",
		"type": "misc",
		"day": "8",
		"start": "12:00",
		"end": "13:20",
		"title": "Lunch",
		"text": "",
		"duration": "80"
	},
	{
		"id": "36",
		"type": "talk",
		"day": "8",
		"start": "13:20",
		"end": "13:50",
		"title": "P2P",
		"duration": "30",
		"speaker": "Feross Aboukhadijeh",
		"slug": "p2p",
		"img": "feross",
		"text": "Let's build something together. Expect P2P, real-time video, and audience participation! More info coming soon.",
		"description": "Founder of WebTorrent, Study Notes & Standard JS"
	},
	{
		"id": "37",
		"type": "talk",
		"day": "8",
		"start": "13:50",
		"end": "14:20",
		"title": "Beyond the bubble",
		"duration": "30",
		"speaker": "Ben Schwarz",
		"slug": "beyond-the-bubble",
		"img": "schwarz",
		"text": "Every talk you'll hear about 'web performance' will tell you that shaving 100ms from response time produced a 1% sales yield for Amazon.com. While that *is* impressive, there are some more interesting numbers that we need to talk about. Did you know that 43% of the humans on the planet have access to the internet, but 57% do not? Did you know that in 2016 alone India will bring 100 million NEW users to the internet for the very first time? (If you're keeping count, thats double and a half the population of the U.K) — when you take a glance and do some research into the current state of global connectivity, you might realise that the internet you think you know so well exists in an entirely different way. In this talk, through the guise of user-experience and empathy, we'll take a look at the state of connectivity, population, costs of data in order to re-centre how we think about our role as designers and developers for the web today. Every talk you'll hear about 'web performance' will tell you that shaving 100ms from response time produced a 1% sales yield for Amazon.com. While that *is* impressive, there are some more interesting numbers that we need to talk about.",
		"description": "Founder of Calibre"
	},
	{
		"id": "38",
		"type": "misc",
		"day": "8",
		"start": "14:20",
		"end": "14:50",
		"title": "Swedish FIKA!",
		"text": "",
		"duration": "30"
	},
	{
		"id": "39",
		"type": "talk",
		"day": "8",
		"start": "14:50",
		"end": "15:20",
		"title": "Reactive Web Animations with RxJS",
		"duration": "30",
		"speaker": "David Khourshid",
		"slug": "reactive-web-animations-with-rxjs",
		"img": "khourshid",
		"text": "UI animations can be an incredible asset to the user experience, especially if they are meaningful and responsive to user input. In this session, we will discover some new and innovative techniques for creating reactive web animations declaratively, using RxJS. You will learn ways to add native-like transitions and smooth animations that respond to user input, in order to create a delightful experience for your users. And of course, there will be plenty of demos.",
		"description": "Web Developer at Microsoft & Pianist"
	},
	{
		"id": "40",
		"type": "lightning",
		"day": "8",
		"start": "15:20",
		"end": "15:25",
		"title": "Lightning talk: BikeShed - JavaScript in and on tvOS",
		"duration": "5",
		"speaker": "Joel Arvidsson",
		"slug": "bikeshed-javascript-in-and-on-tvos"
	},
	{
		"id": "41",
		"type": "lightning",
		"day": "8",
		"start": "15:25",
		"end": "15:30",
		"title": "Lightning talk: Use any Npm module as a distributed scalable microservice, as easy as NodeJS require",
		"duration": "5",
		"speaker": "Joakim Carlstein",
		"slug": "use-any-npm-module-as-a-distributed-scalable-microservice"
	},
	{
		"id": "42",
		"type": "misc",
		"day": "8",
		"start": "15:50",
		"end": "16:10",
		"title": "Break",
		"text": "",
		"duration": "20"
	},
	{
		"id": "43",
		"type": "talk",
		"day": "8",
		"start": "16:10",
		"end": "16:40",
		"title": "TBA.js",
		"duration": "30",
		"speaker": "Guillermo Rauch",
		"slug": "tbajs",
		"img": "rauch",
		"text": "Before starting ▲ZEIT in November 2015, Guillermo was the CTO and co-founder of LearnBoost and Cloudup, acquired by Automattic in 2013. He's the creator of several popular Node.JS open source libraries like socket.io, mongoose and slackin. Prior to Node.JS, he was a core developer of the MooTools frontend toolkit.",
		"description":"Zeit, Socket.io"
	},
	{
		"id": "44",
		"type": "talk",
		"day": "8",
		"start": "16:40",
		"end": "17:10",
		"title": "Keynote: Building Inclusive Communities",
		"duration": "30",
		"speaker": "Karolina Szczur",
		"slug": "building-inclusive-communites",
		"img": "szczur",
		"text": "We’re all a part of a community—design, CSS, JavaScript or any other. But often we fail to reflect on what that actually means and what responsibility it conveys for us as individuals. This talk focuses on understanding what communities are; creating, sustaining and growing them. It offers insight into building participatory culture, fostering empathy and building a better future, together.",
		"description": "Developer, designer & co-organizer of JSConf EU, JSConf AU & CSSConf AU"
	},
	{
		"id": "45",
		"type": "misc",
		"day": "8",
		"start": "17:10",
		"end": "17:20",
		"title": "Closing",
		"text": "",
		"duration": "10"
	},
	{
		"id": "46",
		"type": "misc",
		"day": "8",
		"start": "17:20",
		"end": "02:00",
		"title": "Party / Festen",
		"text": "",
		"duration": "540",
		"speaker": ""
	},
	{
		"id": "47",
		"type": "overlap",
		"day": "8",
		"start": "18:00",
		"end": "20:00",
		"title": "Code in the Dark!",
		"duration": "120",
		"speaker": "",
		"signup": true,
		"slug": "code-in-the-dark"
	}
]
